[FrostAdder_M1 X2CharacterTemplate]
strCharacterName="Frost Legion Adder"
[FrostAdder_M2 X2CharacterTemplate]
strCharacterName="Frost Legion Adder Veteran"
[FrostAdder_M3 X2CharacterTemplate]
strCharacterName="Frost Legion Adder Elite"

[FrostAdder_M1_Shotgun X2WeaponTemplate]
FriendlyName="Frost Adder Shotgun"
FriendlyNamePlural="Frost Adder Shotguns"
[FrostAdder_M2_Shotgun X2WeaponTemplate]
FriendlyName="Frost Adder Shotgun"
FriendlyNamePlural="Frost Adder Shotguns"
[FrostAdder_M3_Shotgun X2WeaponTemplate]
FriendlyName="Frost Adder Shotgun"
FriendlyNamePlural="Frost Adder Shotguns"

[FrostAndromedon X2CharacterTemplate]
strCharacterName="Frost Andromedon"

[FrostAndromedon_Rifle X2WeaponTemplate]
FriendlyName="Frost Andromedon Rifle"
FriendlyNamePlural="Frost Andromedon Rifle"

[FrostArchon X2CharacterTemplate]
strCharacterName="Frost Archon"

[FrostArchon_Rifle X2WeaponTemplate]
FriendlyName="Frost Archon Staff"
FriendlyNamePlural="Frost Archon Staves"
[FrostArchon_Melee X2WeaponTemplate]
FriendlyName="Frost Archon Staff"
FriendlyNamePlural="Frost Archon Staves"

[FrostBerserker_M2 X2CharacterTemplate]
strCharacterName="Frost Berserker"
[FrostBerserker_M3 X2CharacterTemplate]
strCharacterName="Frost Berserker Elite"

[FrostBomber_M1 X2CharacterTemplate]
strCharacterName="Frost Legion Bomber"
[FrostBomber_M2 X2CharacterTemplate]
strCharacterName="Frost Legion Bomber Veteran"
[FrostBomber_M3 X2CharacterTemplate]
strCharacterName="Frost Legion Bomber Elite"

[FrostBruiser_M2 X2CharacterTemplate]
strCharacterName="Frost Legion Bruiser"
[FrostBruiser_M3 X2CharacterTemplate]
strCharacterName="Frost Legion Bruiser Elite"

[FrostBruiser_M2_SMG X2WeaponTemplate]
FriendlyName="Frost Bruiser SMG"
FriendlyNamePlural="Frost Bruiser SMGs"
[FrostBruiser_M3_SMG X2WeaponTemplate]
FriendlyName="Frost Bruiser SMG"
FriendlyNamePlural="Frost Bruiser SMGs"

[FrostBruiser_M2_Shield X2WeaponTemplate]
FriendlyName="Frost Bruiser Shield"
FriendlyNamePlural="Frost Bruiser Shields"
[FrostBruiser_M3_Shield X2WeaponTemplate]
FriendlyName="Frost Bruiser Shield"
FriendlyNamePlural="Frost Bruiser Shields"

[FrostCaptain_M1 X2CharacterTemplate]
strCharacterName="Frost Legion Captain"
[FrostCaptain_M2 X2CharacterTemplate]
strCharacterName="Frost Legion Captain Veteran"
[FrostCaptain_M3 X2CharacterTemplate]
strCharacterName="Frost Legion Captain Elite"

[FrostCaptain_M1_Rifle X2WeaponTemplate]
FriendlyName="Frost Captain Rifle"
FriendlyNamePlural="Frost Captain Rifles"
[FrostCaptain_M2_Rifle X2WeaponTemplate]
FriendlyName="Frost Captain Rifle"
FriendlyNamePlural="Frost Captain Rifles"
[FrostCaptain_M3_Rifle X2WeaponTemplate]
FriendlyName="Frost Captain Rifle"
FriendlyNamePlural="Frost Captain Rifles"

[FrostChryssalidB_M1 X2CharacterTemplate]
strCharacterName="Frost Chryssalid Bleeder"
[FrostChryssalidB_M2 X2CharacterTemplate]
strCharacterName="Frost Chryssalid Bleeder Veteran"
[FrostChryssalidB_M3 X2CharacterTemplate]
strCharacterName="Frost Chryssalid Bleeder Elite"

[FrostChryssalidW_M1 X2CharacterTemplate]
strCharacterName="Frost Chryssalid"
[FrostChryssalidW_M2 X2CharacterTemplate]
strCharacterName="Frost Chryssalid"
[FrostChryssalidW_M3 X2CharacterTemplate]
strCharacterName="Frost Chryssalid"

[FrostCobra X2CharacterTemplate]
strCharacterName="Frost Legion Cobra"

[FrostCobra_Boltcaster X2WeaponTemplate]
FriendlyName="Frost Cobra Boltcaster"

[FrostCodex_M2 X2CharacterTemplate]
strCharacterName="Frost Codex"
[FrostCodex_M3 X2CharacterTemplate]
strCharacterName="Frost Codex Elite"

[FrostCodex_M2_Shotgun X2WeaponTemplate]
FriendlyName="Frost Codex Shotgun"
FriendlyNamePlural="Frost Codex Shotguns"
[FrostCodex_M3_Shotgun X2WeaponTemplate]
FriendlyName="Frost Codex Shotgun"
FriendlyNamePlural="Frost Codex Shotguns"

[FrostDroid_M1 X2CharacterTemplate]
strCharacterName="Frost Droid"
[FrostDroid_M2 X2CharacterTemplate]
strCharacterName="Frost Droid Veteran"
[FrostDroid_M3 X2CharacterTemplate]
strCharacterName="Frost Droid Elite"

[FrostDroidShield_M2 X2CharacterTemplate]
strCharacterName="Frost Shield Droid"
[FrostDroidShield_M3 X2CharacterTemplate]
strCharacterName="Frost Shield Droid"

[FrostDroidShield_M2_Autopistol X2WeaponTemplate]
FriendlyName="Frost Droid Autopistol"
FriendlyNamePlural="Frost Droid Autopistols"
[FrostDroidShield_M3_Autopistol X2WeaponTemplate]
FriendlyName="Frost Droid Autopistol"
FriendlyNamePlural="Frost Droid Autopistols"

[FrostDroid_M2_Shield X2WeaponTemplate]
FriendlyName="Frost Droid Shield"
FriendlyNamePlural="Frost Droid Shields"
[FrostDroid_M3_Shield X2WeaponTemplate]
FriendlyName="Frost Droid Shield"
FriendlyNamePlural="Frost Droid Shields"

[FrostHardliner_M1 X2CharacterTemplate]
strCharacterName="Frost Legion Hardliner"
[FrostHardliner_M2 X2CharacterTemplate]
strCharacterName="Frost Legion Hardliner Veteran"
[FrostHardliner_M3 X2CharacterTemplate]
strCharacterName="Frost Legion Hardliner Elite"

[FrostHardliner_M1_Rifle X2WeaponTemplate]
FriendlyName="Frost Hardliner Rifle"
FriendlyNamePlural="Frost Hardliner Rifles"
[FrostHardliner_M2_Rifle X2WeaponTemplate]
FriendlyName="Frost Hardliner Rifle"
FriendlyNamePlural="Frost Hardliner Rifles"
[FrostHardliner_M3_Rifle X2WeaponTemplate]
FriendlyName="Frost Hardliner Rifle"
FriendlyNamePlural="Frost Hardliner Rifles"

[FrostHitman_M1 X2CharacterTemplate]
strCharacterName="Frost Legion Hitman"
[FrostHitman_M2 X2CharacterTemplate]
strCharacterName="Frost Legion Hitman Veteran"
[FrostHitman_M3 X2CharacterTemplate]
strCharacterName="Frost Legion Hitman Elite"

[FrostHitman_M1_Pistol X2WeaponTemplate]
FriendlyName="Frost Hitman Pistol"
FriendlyNamePlural="Frost Hitman Pistols"
[FrostHitman_M2_Pistol X2WeaponTemplate]
FriendlyName="Frost Hitman Pistol"
FriendlyNamePlural="Frost Hitman Pistols"
[FrostHitman_M3_Pistol X2WeaponTemplate]
FriendlyName="Frost Hitman Pistol"
FriendlyNamePlural="Frost Hitman Pistols"

[FrostLancer_M1 X2CharacterTemplate]
strCharacterName="Frost Lancer"
[FrostLancer_M2 X2CharacterTemplate]
strCharacterName="Frost Lancer Veteran"
[FrostLancer_M3 X2CharacterTemplate]
strCharacterName="Frost Lancer Elite"

[FrostMamba X2CharacterTemplate]
strCharacterName="Frost Mamba"

[FrostMamba_Rifle X2WeaponTemplate]
FriendlyName="Frost Mamba Rifle"
FriendlyNamePlural="Frost Mamba Rifles"

[FrostMEC_M1 X2CharacterTemplate]
strCharacterName="Frost MEC"
[FrostMEC_M2 X2CharacterTemplate]
strCharacterName="Frost MEC Veteran"
[FrostMEC_M3 X2CharacterTemplate]
strCharacterName="Frost MEC Elite"

[FrostMEC_M1_Rifle X2WeaponTemplate]
FriendlyName="Frost MEC Rifle"
FriendlyNamePlural="Frost MEC Rifles"
[FrostMEC_M2_Rifle X2WeaponTemplate]
FriendlyName="Frost MEC Rifle"
FriendlyNamePlural="Frost MEC Rifles"
[FrostMEC_M3_Rifle X2WeaponTemplate]
FriendlyName="Frost MEC Rifle"
FriendlyNamePlural="Frost MEC Rifles"

[FD_FrostMicroMissles_M1 X2WeaponTemplate]
FriendlyName="Frost Micromissle Launcher"
FriendlyNamePlural="Frost Micromissle Launchers"
[FD_FrostMicroMissles_M2 X2WeaponTemplate]
FriendlyName="Frost Micromissle Launcher"
FriendlyNamePlural="Frost Micromissle Launchers"
[FD_FrostMicroMissles_M3 X2WeaponTemplate]
FriendlyName="Frost Micromissle Launcher"
FriendlyNamePlural="Frost Micromissle Launchers"

[FrostMuton_M2 X2CharacterTemplate]
strCharacterName="Frost Muton"
[FrostMuton_M3 X2CharacterTemplate]
strCharacterName="Frost Muton Elite"

[FrostMuton_M2_Rifle X2WeaponTemplate]
FriendlyName="Frost Muton Rifle"
FriendlyNamePlural="Frost Muton Rifles"
[FrostMuton_M3_Rifle X2WeaponTemplate]
FriendlyName="Frost Muton Rifle"
FriendlyNamePlural="Frost Muton Rifles"

[FrostNecromancer_M1 X2CharacterTemplate]
strCharacterName="Frost Legion Necromancer"
[FrostNecromancer_M2 X2CharacterTemplate]
strCharacterName="Frost Legion Necromancer Veteran"
[FrostNecromancer_M3 X2CharacterTemplate]
strCharacterName="Frost Legion Necromancer Elite"

[FrostNecromancer_M1_Blaster X2WeaponTemplate]
FriendlyName="Frost Necromancer Blaster"
FriendlyNamePlural="Frost Necromancer Blasters"
[FrostNecromancer_M2_Blaster X2WeaponTemplate]
FriendlyName="Frost Necromancer Blaster"
FriendlyNamePlural="Frost Necromancer Blasters"
[FrostNecromancer_M3_Blaster X2WeaponTemplate]
FriendlyName="Frost Necromancer Blaster"
FriendlyNamePlural="Frost Necromancer Blasters"

[FrostPriest_M1 X2CharacterTemplate]
strCharacterName="Frost Priest"
[FrostPriest_M2 X2CharacterTemplate]
strCharacterName="Frost Priest Veteran"
[FrostPriest_M3 X2CharacterTemplate]
strCharacterName="Frost Priest Elite"

[FrostPsiLancer_M1 X2CharacterTemplate]
strCharacterName="Frost PsiLancer"
[FrostPsiLancer_M2 X2CharacterTemplate]
strCharacterName="Frost PsiLancer Veteran"
[FrostPsiLancer_M3 X2CharacterTemplate]
strCharacterName="Frost PsiLancer Elite"

[FrostPsilancer_M1_Gauntlet X2WeaponTemplate]
FriendlyName="Frost PsiLancer Gauntlets"
FriendlyNamePlural="Frost PsiLancer Gauntlets"
[FrostPsilancer_M2_Gauntlet X2WeaponTemplate]
FriendlyName="Frost PsiLancer Gauntlets"
FriendlyNamePlural="Frost PsiLancer Gauntlets"
[FrostPsilancer_M3_Gauntlet X2WeaponTemplate]
FriendlyName="Frost PsiLancer Gauntlets"
FriendlyNamePlural="Frost PsiLancer Gauntlets"

[FrostPudding_M1 X2CharacterTemplate]
strCharacterName="Animate Cryolite"
[FrostPudding_M2 X2CharacterTemplate]
strCharacterName="Animate Cryolite Veteran"
[FrostPudding_M3 X2CharacterTemplate]
strCharacterName="Animate Cryolite Elite"

[FrostPuddingTrooper_M1 X2CharacterTemplate]
strCharacterName="Frost Trooper"
[FrostPuddingTrooper_M2 X2CharacterTemplate]
strCharacterName="Frost Trooper Veteran"
[FrostPuddingTrooper_M3 X2CharacterTemplate]
strCharacterName="Frost Trooper Elite"

[FrostPurifier_M1 X2CharacterTemplate]
strCharacterName="Frost Purifier"
[FrostPurifier_M2 X2CharacterTemplate]
strCharacterName="Frost Purifier Veteran"
[FrostPurifier_M3 X2CharacterTemplate]
strCharacterName="Frost Purifier Elite"

[FrostPurifier_M1_Cryolator X2WeaponTemplate]
FriendlyName="Frost Purifier Cryolator"
FriendlyNamePlural="Frost Purifier Cryolators"
[FrostPurifier_M2_Cryolator X2WeaponTemplate]
FriendlyName="Frost Purifier Cryolator"
FriendlyNamePlural="Frost Purifier Cryolators"
[FrostPurifier_M3_Cryolator X2WeaponTemplate]
FriendlyName="Frost Purifier Cryolator"
FriendlyNamePlural="Frost Purifier Cryolators"

[FrostSectoid_M2 X2CharacterTemplate]
strCharacterName="Frost Sectoid"
[FrostSectoid_M3 X2CharacterTemplate]
strCharacterName="Frost Sectoid Elite"

[FrostSpectre_M2 X2CharacterTemplate]
strCharacterName="Frost Legion Spectre"
[FrostSpectre_M3 X2CharacterTemplate]
strCharacterName="Frost Legion Spectre Elite"

[FrostSpectre_M2_Gauntlet X2WeaponTemplate]
FriendlyName="Frost Spectre Gauntlets"
FriendlyNamePlural="Frost Spectre Gauntlets"
[FrostSpectre_M3_Gauntlet X2WeaponTemplate]
FriendlyName="Frost Spectre Gauntlets"
FriendlyNamePlural="Frost Spectre Gauntlets"

[FrostTech_M2 X2CharacterTemplate]
strCharacterName="Frost Technician"
[FrostTech_M3 X2CharacterTemplate]
strCharacterName="Frost Technician Elite"

[FrostTech_M2_Gremlin X2WeaponTemplate]
FriendlyName="Frost Technician Gremlin"
FriendlyNamePlural="Frost Technician Gremlins"
[FrostTech_M3_Gremlin X2WeaponTemplate]
FriendlyName="Frost Technician Gremlin"
FriendlyNamePlural="Frost Technician Gremlins"

[FrostTech_M2_Rifle X2WeaponTemplate]
FriendlyName="Frost Technician Rifle"
FriendlyNamePlural="Frost Technician Rifles"
[FrostTech_M3_Rifle X2WeaponTemplate]
FriendlyName="Frost Technician Rifle"
FriendlyNamePlural="Frost Technician Rifles"

[FrostTrooper_M1 X2CharacterTemplate]
strCharacterName="Frost Trooper"
[FrostTrooper_M2 X2CharacterTemplate]
strCharacterName="Frost Trooper Veteran"
[FrostTrooper_M3 X2CharacterTemplate]
strCharacterName="Frost Trooper Elite"

[FrostTrooper_M1_SMG X2WeaponTemplate]
FriendlyName="Frost Trooper SMG"
FriendlyNamePlural="Frost Trooper SMGs"
[FrostTrooper_M2_SMG X2WeaponTemplate]
FriendlyName="Frost Trooper SMG"
FriendlyNamePlural="Frost Trooper SMGs"
[FrostTrooper_M3_SMG X2WeaponTemplate]
FriendlyName="Frost Trooper SMG"
FriendlyNamePlural="Frost Trooper SMGs"

[FrostViper_M2 X2CharacterTemplate]
strCharacterName="Frost Viper"
[FrostViper_M3 X2CharacterTemplate]
strCharacterName="Frost Viper Elite"

[FrostViper_M2_SMG X2WeaponTemplate]
FriendlyName="Frost Viper SMG"
FriendlyNamePlural="Frost Viper SMGs"
[FrostViper_M3_SMG X2WeaponTemplate]
FriendlyName="Frost Viper SMG"
FriendlyNamePlural="Frost Viper SMGs"

[SpectralFrostZombie_M1 X2CharacterTemplate]
strCharacterName="Spectral Frost Zombie"
[SpectralFrostZombie_M2 X2CharacterTemplate]
strCharacterName="Spectral Frost Zombie"
[SpectralFrostZombie_M3 X2CharacterTemplate]
strCharacterName="Spectral Frost Zombie"

[FrostZombie_M1 X2CharacterTemplate]
strCharacterName="Frost Zombie"
[FrostZombie_M2 X2CharacterTemplate]
strCharacterName="Frost Zombie"
[FrostZombie_M3 X2CharacterTemplate]
strCharacterName="Frost Zombie"

[FrostZombie_M1_Slap X2WeaponTemplate]
FriendlyName="Frost Zombie Slap"
FriendlyNamePlural="Frost Zombie Slaps"
[FrostZombie_M2_Slap X2WeaponTemplate]
FriendlyName="Frost Zombie Slap"
FriendlyNamePlural="Frost Zombie Slaps"
[FrostZombie_M3_Slap X2WeaponTemplate]
FriendlyName="Frost Zombie Slap"
FriendlyNamePlural="Frost Zombie Slaps"

[FD_ChillGrenade_M1 X2GrenadeTemplate]
FriendlyName="Cryo Grenade"
FriendlyNamePlural="Cryo Grenades"
ThrownAbilityName="Throw Cryo Grenade"
ThrownAbilityHelpText="Throw a cryo grenade at target area. Deals frost damage and inflicts bitterfrost."
LaunchedAbilityname="Launch Cryo Grenade"
LaunchedAbilityHelpText="Launch a cryo grenade at target area. Deals frost damage and inflicts bitterfrost."
[FD_ChillGrenade_M2 X2GrenadeTemplate]
FriendlyName="Cryo Grenade"
FriendlyNamePlural="Cryo Grenades"
ThrownAbilityName="Throw Cryo Grenade"
ThrownAbilityHelpText="Throw a cryo grenade at target area. Deals frost damage and inflicts bitterfrost.
LaunchedAbilityname="Launch Cryo Grenade"
LaunchedAbilityHelpText="Launch a cryo grenade at target area. Deals frost damage and inflicts bitterfrost."
[FD_ChillGrenade_M3 X2GrenadeTemplate]
FriendlyName="Cryo Grenade"
FriendlyNamePlural="Cryo Grenades"
ThrownAbilityName="Throw Cryo Grenade"
ThrownAbilityHelpText="Throw a cryo grenade at target area. Deals frost damage and inflicts bitterfrost.
LaunchedAbilityname="Launch Cryo Grenade"
LaunchedAbilityHelpText="Launch a cryo grenade at target area. Deals frost damage and inflicts bitterfrost."
[FD_ChillGrenade_Muton_M2 X2GrenadeTemplate]
FriendlyName="Cryo Grenade"
FriendlyNamePlural="Cryo Grenades"
ThrownAbilityName="Throw Cryo Grenade"
ThrownAbilityHelpText="Throw a cryo grenade at target area. Deals frost damage and inflicts bitterfrost.
LaunchedAbilityname="Launch Cryo Grenade"
LaunchedAbilityHelpText="Launch a cryo grenade at target area. Deals frost damage and inflicts bitterfrost."
[FD_ChillGrenade_Muton_M3 X2GrenadeTemplate]
FriendlyName="Cryo Grenade"
FriendlyNamePlural="Cryo Grenades"
ThrownAbilityName="Throw Cryo Grenade"
ThrownAbilityHelpText="Throw a cryo grenade at target area. Deals frost damage and inflicts bitterfrost.
LaunchedAbilityname="Launch Cryo Grenade"
LaunchedAbilityHelpText="Launch a cryo grenade at target area. Deals frost damage and inflicts bitterfrost."

[FD_FreezeGrenade_M1 X2GrenadeTemplate]
FriendlyName="Freeze Grenade"
FriendlyNamePlural="Freeze Grenades"
BriefSummary="Relying on an as-of-yet unidentified chemical agent, these hand-held explosives seem capable of instantaneously reducing the ambient temperature of the surrounding area. Exposed tissue will be frozen on contact."
TacticalText="<Bullet/> Freeze Grenades freeze all units in the blast radius, preventing them from taking any actions for one turn."
ThrownAbilityName="Throw Freeze Grenade"
ThrownAbilityHelpText="Freeze all units in the target area."
LaunchedAbilityname="Launch Freeze Grenade"
LaunchedAbilityHelpText="Freeze all units in the target area."

[MZ_FDHitmanReturnFire X2AbilityTemplate]
LocFriendlyName="Hitman Return Fire"
LocHelpText="The Hitman will fire thier pistol at hostiles taking offensive actions."
LocLongDescription="The Hitman will fire thier pistol at hostiles taking offensive actions."

[MZFD_VolatileDummy X2AbilityTemplate]
LocFriendlyName="Volatile Cryolite Tanks"
LocHelpText="Will explode when killed, damaging and chilling nearby targets."
LocLongDescription="Will explode when killed, damaging and chilling nearby targets."

[MZ_FDBomberCCSAttack X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocHelpText="The Bomber fires their shotgun at any hostiles moving near them."
LocFlyoverText="Close Combat Specialist"
[MZ_FDBomberCCS X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocHelpText="The Bomber fires their shotgun at any hostiles moving near them."
LocLongDescription="The Bomber fires their shotgun at any hostiles moving near them."

[MZ_FDBruiserCounterShot X2AbilityTemplate]
LocFriendlyName="Countershot"
LocHelpText="Missed attacks against the Frost Legion Bruiser are deflected. Returns fire after deflecting an attack."
[MZ_FDBruiserCounterShot X2AbilityTemplate]
LocFriendlyName="Bruiser Countershot"
LocHelpText="Missed attacks against the Frost Legion Bruiser are deflected. Returns fire after deflecting an attack."

[MZ_FDFrostPunch X2AbilityTemplate]
LocFriendlyName="Frost Punch"
LocHelpText="Attack a nearby foe. Inflicts bitterfrost."
LocLongDescription="Attack a nearby foe. Inflicts bitterfrost."

[MZ_FDFrostShieldBash X2AbilityTemplate]
LocFriendlyName="Frost Shield Bash"
LocHelpText="Charge and slam a target with your shield. Inflicts bitterfrost."
LocLongDescription="Charge and slam a target with your shield. Inflicts bitterfrost."

[MZ_FDFrostAxeSlash X2AbilityTemplate]
LocFriendlyName="Frost Axe Slash"
LocHelpText="Charge and slash a target with your axe. Inflicts bitterfrost."
LocLongDescription="Charge and slash a target with your axe. Inflicts bitterfrost."

[MZ_FDFrostRend X2AbilityTemplate]
LocFriendlyName="Frost Rend"
LocHelpText="Charge and slash a target with frigid psionic blades. Inflicts bitterfrost."
LocLongDescription="Charge and slash a target with frigid psionic blades. Inflicts bitterfrost."
[MZ_FDParry X2AbilityTemplate]
LocFriendlyName="Frost Parry"
LocLongDescription="After attacking with Frost Rend, prevent all damage from the next attack."
LocHelpText="After attacking with Frost Rend, prevent all damage from the next attack."
LocFlyoverText="Parried!"

[MZ_FDMutonBayonetStab X2AbilityTemplate]
LocFriendlyName="Frost Bayonet Stab"
LocHelpText="Attack a nearby foe. Inflicts bitterfrost."
LocLongDescription="Attack a nearby foe. Inflicts bitterfrost."
[MZ_FDMutonBayonetCounter X2AbilityTemplate]
LocFriendlyName="Frost Counterattack"
LocHelpText="Parry and counter a melee attack. Inflicts bitterfrost."
LocLongDescription="Parry and counter a melee attack. Inflicts bitterfrost."
[MZ_FDMutonBayonetCharge X2AbilityTemplate]
LocFriendlyName="Frost Bayonet Charge"
LocHelpText="Charge and slash a target with your bayonet. Inflicts bitterfrost."
LocLongDescription="Charge and slash a target with your bayonet. Inflicts bitterfrost."


[MZ_FDFrostMicroMissiles X2AbilityTemplate]
LocFriendlyName="Frost Micro Missiles"
LocLongDescription="The MEC's shoulder mounted missile launcher can volley a salvo of missiles that deal cold damage in a small area."
LocHelpText="Target an area with a frigid missle attack. Inflicts bitterfrost."

[MZ_FDHardlinerFreezeLauncher X2AbilityTemplate]
LocFriendlyName="Freezing Micro Missiles"
LocLongDescription="The Hardliner's arm mounted missile launcher can volley a salvo of missiles that instantly freeze targets in a small area."
LocHelpText="Target an area with a freezing missle attack. Inflicts Frozen."

[MZ_FDAndromedonFrostBlob X2AbilityTemplate]
LocFriendlyName="Cryogenic Bomb"
LocLongDescription="Launch a glob of cryogenic liquid that splatters on impact, inflicting bitterfrost on everthing in the vicinity."
LocHelpText="Launch a glob of cryogenic liquid that splatters on impact, inflicting bitterfrost on everthing in the vicinity."
LocFlyOverText="Cryogenic Bomb"
[FrostAndromedon_FrostBlob X2GrenadeTemplate]
LocFriendlyName="Cryogenic Bomb"
LocLongDescription="The Frost Andromedon's internal coolant is unbeliveably cold. This creature can launch a glob of this viscious liquid that splatters on impact, chilling everthing in the vicinity."
LocHelpText="Launch a blob of bitterfrost at an area."
LocFlyOverText="Cryogenic Bomb"

[MZ_FDIceShield X2AbilityTemplate]
LocFriendlyName="Ice Shield"
LocHelpText="Immunity to Cold. Ice Shields reduce damage by 50% while they hold. Vulnerable to Fire or Psionic damage."
LocLongDescription="Immunity to Cold. Ice Shields reduce damage by 50% while they hold. Vulnerable to Fire or Psionic damage."

[MZ_FDRechargeShield X2AbilityTemplate]
LocFriendlyName="Recharging Shield"
LocHelpText="Ice Shields regenerate over time."
LocLongDescription="Ice Shields regenerate over time."

[MZ_FDBleedCold X2AbilityTemplate]
LocFriendlyName="Bleed Cold"
LocHelpText=""When this creature is wounded in close range, inflicts damage and bitterfrost on the attacker."
LocLongDescription="When this creature is wounded in close range, inflicts damage and bitterfrost on the attacker."
LocFlyOverText="Bleed Cold"
[MZ_FDBleedColdTrigger X2AbilityTemplate]
LocFriendlyName="Bleed Cold"
LocFlyOverText="Bleed Cold"

[MZ_FDShrikeLeader_Necro X2AbilityTemplate]
LocFriendlyName="Frost Legion Necromancer"
LocHelpText="Immunity to electrical and mental attacks."
LocLongDescription="Immunity to electrical and mental attacks."
[MZ_FDShrikeLeader_M1 X2AbilityTemplate]
LocFriendlyName="Frost Legion Leader"
LocHelpText="Immunity to electrical and mental attacks. Ice Shields regenerate over time."
LocLongDescription="Immunity to electrical and mental attacks. Ice Shields regenerate over time."
[MZ_FDBruiserLeader_M2 X2AbilityTemplate]
LocFriendlyName="Frost Legion Bruiser"
LocHelpText="Immunity to electrical and mental attacks. Ice Shields regenerate over time."
LocLongDescription="Immunity to electrical and mental attacks. Ice Shields regenerate over time."
[MZ_FDBruiserLeader_M3 X2AbilityTemplate]
LocFriendlyName="Frost Legion Bruiser"
LocHelpText="Immunity to electrical and mental attacks. Ice Shields regenerate over time."
LocLongDescription="Immunity to electrical and mental attacks. Ice Shields regenerate over time."

[MZ_FDCobraPrimeReaction X2AbilityTemplate]
LocFriendlyName="Merciless Killer"
LocHelpText="Takes a bonus action whenever anything dies."
LocLongDescription="Takes a bonus action whenever anything dies."

[MZ_FDMarkTarget X2AbilityTemplate]
LocFriendlyName="Frost Mark Target"
LocLongDescription="ADVENT Officers can Mark a target, commanding other ADVENT soldiers to focus their fire on that target. Any ADVENT that attack the marked target have a bonus to Aim."
LocHelpText="Mark an enemy target, chilling them. Allies gain +<Ability:MARKTARGETAIMBONUS/> Aim when attacking the target"
LocFlyOverText="Frost Mark Target"

[MZ_FDFrostProtocol X2AbilityTemplate]
LocFriendlyName="Frost Protocol"
LocLongDescription="Send the GREMLIN to attack a target, inflicting cold damage and bitterfrost."
LocHelpText="Send the GREMLIN to attack a target, inflicting cold damage and bitterfrost."
LocFlyOverText="Frost Protocol"

[MZ_FDBlindCold X2AbilityTemplate]
LocFriendlyName="Blinding Cold"
LocHelpText="Inflict Blind and Bitterfrost on a single target."
LocLongDescription="Inflict Blind and Bitterfrost on a single target."
LocFlyOverText="Blinding Cold"
LocMissMessage="Blinding Cold resisted!"

[MZ_FDFreezeWeapon X2AbilityTemplate]
LocFriendlyName="Freeze Weapon"
LocHelpText="Disable a target's weapon by freezing it. Inflicts bitterfrost."
LocLongDescription="Disable a target's weapon by freezing it. Inflicts bitterfrost."
LocFlyOverText="Freeze Weapon"
LocMissMessage="Freeze Weapon resisted!"

[MZ_FDFrostMindspin X2AbilityTemplate]
LocFriendlyName="Mindfreeze"
LocHelpText="Disable a target's weapon by freezing it. Inflicts bitterfrost."
LocLongDescription="Disable a target's weapon by freezing it. Inflicts bitterfrost
LocFlyOverText="Mindfreeze"
LocMissMessage="Mindfreeze resisted!"

[MZ_FDFrostPriestBuff_M1 X2AbilityTemplate]
LocFriendlyName="Frost Warrior"
LocHelpText="Grants an ally a rapidly regenerating shield, as well as bonuses to mobilty and aim. This effect is removed if the Priest is killed."
LocLongDescription="Grants an ally a rapidly regenerating shield, as well as bonuses to mobilty and aim. This effect is removed if the Priest is killed."
LocFlyOverText="Frost Warrior"
[MZ_FDFrostPriestBuff_M2 X2AbilityTemplate]
LocFriendlyName="Frost Warrior"
LocHelpText="Grants an ally a rapidly regenerating shield, as well as bonuses to mobilty and aim. This effect is removed if the Priest is killed."
LocLongDescription="Grants an ally a rapidly regenerating shield, as well as bonuses to mobilty and aim. This effect is removed if the Priest is killed."
LocFlyOverText="Frost Warrior"
[MZ_FDFrostPriestBuff_M3 X2AbilityTemplate]
LocFriendlyName="Frost Warrior"
LocHelpText="Grants an ally a rapidly regenerating shield, as well as bonuses to mobilty and aim. This effect is removed if the Priest is killed."
LocLongDescription="Grants an ally a rapidly regenerating shield, as well as bonuses to mobilty and aim. This effect is removed if the Priest is killed."
LocFlyOverText="Frost Warrior"

[MZ_FDBruiserShieldArea_M2 X2AbilityTemplate]
LocFriendlyName="Frost Overshield"
LocLongDescription="The Bruiser can grant a recharging energy shield to all nearby allies. The shields will collapse if this unit is killed."
LocHelpText="Project a recharging energy shield around nearby allies and yourself."
LocFlyOverText="Frost Overshield"
[MZ_FDBruiserShieldArea_M3 X2AbilityTemplate]
LocFriendlyName="Frost Overshield"
LocLongDescription="The Bruiser can grant a recharging energy shield to all nearby allies. The shields will collapse if this unit is killed."
LocHelpText="Project a recharging energy shield around nearby allies and yourself."
LocFlyOverText="Frost Overshield"

[MZ_FDReanimateFrostZombie_M1 X2AbilityTemplate]
LocFriendlyName="Spectral Frost Reanimation"
LocLongDescription="A Sectoid can flood the nervous systems of recently dead humanoids with Psionic energy, causing them to move and fight as puppets under its control as 'spectral frost zombies'."
LocHelpText="Raise a dead soldier, civilian, or ADVENT soldier as a Spectral Frost Zombie."
LocFlyOverText="Spectral Frost Reanimation"
[MZ_FDReanimateFrostZombie_M2 X2AbilityTemplate]
LocFriendlyName="Spectral Frost Reanimation"
LocLongDescription="A Sectoid can flood the nervous systems of recently dead humanoids with Psionic energy, causing them to move and fight as puppets under its control as 'spectral frost zombies'."
LocHelpText="Raise a dead soldier, civilian, or ADVENT soldier as a Spectral Frost Zombie."
LocFlyOverText="Spectral Frost Reanimation"
[MZ_FDReanimateFrostZombie_M3 X2AbilityTemplate]
LocFriendlyName="Spectral Frost Reanimation"
LocLongDescription="A Sectoid can flood the nervous systems of recently dead humanoids with Psionic energy, causing them to move and fight as puppets under its control as 'spectral frost zombies'."
LocHelpText="Raise a dead soldier, civilian, or ADVENT soldier as a Spectral Frost Zombie."
LocFlyOverText="Spectral Frost Reanimation"

[MZ_FDChryssalidFrostSlash_M1 X2AbilityTemplate]
LocFriendlyName="Frost Chryssalid Slash"
LocLongDescription="A melee attack that injects a bitterfrost venom."
LocHelpText="Attack a melee target with your claws, inflicting bitterfrost."
[MZ_FDChryssalidFrostSlash_M2 X2AbilityTemplate]
LocFriendlyName="Frost Chryssalid Slash"
LocLongDescription="A melee attack that injects a bitterfrost venom."
LocHelpText="Attack a melee target with your claws, inflicting bitterfrost."
[MZ_FDChryssalidFrostSlash_M3 X2AbilityTemplate]
LocFriendlyName="Frost Chryssalid Slash"
LocLongDescription="A melee attack that injects a bitterfrost venom."
LocHelpText="Attack a melee target with your claws, inflicting bitterfrost."

[MZ_FDChryssalidFrostNeedle_M1 X2AbilityTemplate]
LocFriendlyName="Frost Chryssalid Quick Bite"
LocLongDescription="An armour-piercing melee attack that injects a bitterfrost venom."
LocHelpText="Attack a melee target with your claws, inflicting bitterfrost. Ignores armour."
[MZ_FDChryssalidFrostNeedle_M2 X2AbilityTemplate]
LocFriendlyName="Frost Chryssalid Quick Bite"
LocLongDescription="An armour-piercing melee attack that injects a bitterfrost venom."
LocHelpText="Attack a melee target with your claws, inflicting bitterfrost. Ignores armour."
[MZ_FDChryssalidFrostNeedle_M3 X2AbilityTemplate]
LocFriendlyName="Frost Chryssalid Quick Bite"
LocLongDescription="An armour-piercing melee attack that injects a bitterfrost venom."
LocHelpText="Attack a melee target with your claws, inflicting bitterfrost. Ignores armour."

[MZ_FDFrostPuddingCleave_M1 X2AbilityTemplate]
LocFriendlyName="Frost Scything Claws"
LocLongDescription="The shapechanging abilities of a Frost Pudding permit it to grow giant claws that can strike enemies from several meters away."
LocHelpText="Close-range swipe at a target with the Frost Pudding claws. Inflicts Bitterfrost."
LocFlyOverText="Frost Scything Claws"
[MZ_FDFrostPuddingCleave_M2 X2AbilityTemplate]
LocFriendlyName="Frost Scything Claws"
LocLongDescription="The shapechanging abilities of a Frost Pudding permit it to grow giant claws that can strike enemies from several meters away."
LocHelpText="Close-range swipe at a target with the Frost Pudding claws. Inflicts Bitterfrost."
LocFlyOverText="Frost Scything Claws"
[MZ_FDFrostPuddingCleave_M3 X2AbilityTemplate]
LocFriendlyName="Frost Scything Claws"
LocLongDescription="The shapechanging abilities of a Frost Pudding permit it to grow giant claws that can strike enemies from several meters away."
LocHelpText="Close-range swipe at a target with the Frost Pudding claws. Inflicts Bitterfrost."
LocFlyOverText="Frost Scything Claws"

[MZ_FDBeserkerIcePunch_M2 X2AbilityTemplate]
LocFriendlyName="Glacier Punch"
LocLongDescription="A Frost Berserker's strength is sufficient to batter her enemies to death with nothing more than her fists. This attack can damage additional nearby targets."
LocHelpText="Attack a melee target, and also do reduced damage to nearby targets. inflicts bitterfrost."
LocFlyOverText="Glacier Punch"
[MZ_FDBeserkerIcePunch_M3 X2AbilityTemplate]
LocFriendlyName="Glacier Punch"
LocLongDescription="A Frost Berserker's strength is sufficient to batter her enemies to death with nothing more than her fists. This attack can damage additional nearby targets."
LocHelpText="Attack a melee target, and also do reduced damage to nearby targets. inflicts bitterfrost."
LocFlyOverText="Glacier Punch"

[MZ_FDBigDamnPunch X2AbilityTemplate]
LocFriendlyName="Glacier Strike"
LocLongDescription="The Frost Andromedon's Battlesuit is fantastically strong. Its melee attacks aren't very accurate, but they are devastating."
LocHelpText="Strike at a melee target. inflicts bitterfrost."
LocFlyOverText="Glacier Strike"

[MZ_FDSpectreShot X2AbilityTemplate]
LocFriendlyName="Frigid Pulse"
LocHelpText="Launch a chilling psionic pulse at a single target. <Ability:CANNOTBEDODGED/>"
LocLongDescription="Launch a chilling psionic pulse at a single target. <Ability:CANNOTBEDODGED/>"
LocFlyOverText="Frigid Pulse"
[MZ_FDSpectreOverwatchShot X2AbilityTemplate]
LocFriendlyName="Frigid Pulse (Overwatch)"
LocFlyOverText="Frigid Pulse (Overwatch)"

[MZ_FDShadowbind_M2 X2AbilityTemplate]
LocFriendlyName="Frost Shadowbind"
LocHelpText="Creates a shadowy copy of a humanoid target, which retains all of the target's abilities."
LocLongDescription="Creates a shadowy copy of a humanoid target, which retains all of the target's abilities."
LocFlyOverText="Frost Shadowbind"
[MZ_FDShadowbind_M3 X2AbilityTemplate]
LocFriendlyName="Frost Shadowbind"
LocHelpText="Creates a shadowy copy of a humanoid target, which retains all of the target's abilities."
LocLongDescription="Creates a shadowy copy of a humanoid target, which retains all of the target's abilities."
LocFlyOverText="Frost Shadowbind"

[MZFD_RemoteStart X2AbilityTemplate]
LocFriendlyName="Remote Start"
LocLongDescription="Detonate an environmental explosive, causing it to deal damage within twice its normal radius."
LocHelpText="Detonate an environmental explosive, causing it to deal damage within twice its normal radius."
LocPromotionPopupText="<Bullet/> Make sure squadmates are clear of the blast zone!<br/><Bullet/> Remote Start requires <Ability:SelfAmmoCost/> ammo point, and has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[MZ_Shrike_SingleReload X2AbilityTemplate]
LocFriendlyName="Single Reload"
LocHelpText="Reload a bolt into your Sniper Boltcaster."
LocFlyOverText="Reloading"

[MZ_DarkEventAbility_MZ_FrostSealedArmor X2AbilityTemplate]
LocFriendlyName="Dark Event: Sealed Armour"
LocHelpText="Immunity to Electricity, Poison and Venom."
LocLongDescription="Immunity to Electricity, Poison and Venom."

[MZ_FDChosenIceShield X2AbilityTemplate]
LocFriendlyName="Ice Shielded"
LocHelpText="Immunity to Cold. Ice Shields reduce damage by 50% while they hold. Vulnerable to Fire or Psionic damage."
LocLongDescription="Immunity to Cold. Ice Shields reduce damage by 50% while they hold. Vulnerable to Fire or Psionic damage."

[ChosenSummonFrostLegion X2AbilityTemplate]
LocFriendlyName="Frost Legion Director"
LocLongDescription="Chosen can summon Frost Legion troops."
LocHelpText="Chosen can summon Frost Legion troops."
LocFlyOverText="Frost Legion Director"
LocPromotionPopupText="<Bullet/> Chosen can summon Frost Legion troops."

[ChosenFrostPersonality X2AbilityTemplate]
LocFriendlyName="Icy Demeanor"
LocLongDescription="Chosen attacks inflict bitterfrost."
LocHelpText="Chosen attacks inflict bitterfrost."
LocFlyOverText="Icy Demeanor"
LocPromotionPopupText="<Bullet/> Chosen attacks inflict bitterfrost."


[FrostTroopDeployment X2SitRepTemplate]
FriendlyName="Frost Legion Battalion"
Description="Heavy Frost Legion Troop numbers to be deployed on this mission."

[FrostTroopDeploymentEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FriendlyName="Frost Legion Battalion"
Description="The ADVENT Frost Legion is pressing XCom hard. They are deploying a larger force to the AO to try and halt XCom's advance."

[FrostPurge X2SitRepTemplate]
FriendlyName="Frost Legion Purge"
Description="The ADVENT Frost Legion has dropped alien units in and looking to cleanse the area."

[FrostPurgeEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FriendlyName="Frost Legion Purge"
Description="The ADVENT Frost Legion is attempting to purged this area of dissidents. They have deployed larger alien units to track down and remove any remaining survivors."

[POI_FD_ShrikeGear X2PointOfInterestTemplate]
DisplayNames[0]="Shrike Weapons Locker"
CompletedSummaries[0]="The Frost Legion was using this location to store various equipment before being routed by resistance forces. We were able to repurpose several of the weapons for ourselves."
POIImages[0]="img:///UILibrary_strategyimages.X2StrategyMap.POI_StolenGoods"

[Reward_FD_ShrikeWeapon X2RewardTemplate]
DisplayName="Shrike Weaponry"
[Reward_FD_Cryolite X2RewardTemplate]
DisplayName="Cryolite"

[MZFD_Cryolite X2ItemTemplate]
FriendlyName="Cryolite"
FriendlyNamePlural="Cryolite"
BriefSummary="This unnaturally cold substance is used by the ADVENT Frost Legion to power their ice shields and weaponry."
BlackMarketTexts="Fell of the back of a Frost Legion Van. Perfect for keeping food refrigerated."

[MZFD_WarmSweater X2EquipmentTemplate]
FriendlyName="Warm Sweater"
FriendlyNamePlural="Warm Sweaters"
BriefSummary="A nice warm sweater that keeps our soldiers warm when the aliens are throwing ice all over the show."
TacticalText="<Bullet/> Provides immunity to cold damage."
[MZFD_SweaterBonus X2AbilityTemplate]
LocFriendlyName="Warm Sweater"
LocHelpText="Immunity to Cold."
LocLongDescription="Immunity to Cold."

[MZ_ShrikeVektor_CV X2WeaponTemplate]
FriendlyName="Shrike Vektor Rifle"
FriendlyNamePlural="Shrike Vektor Rifles"
BriefSummary="Reliant on a specialized cartridge presumably handloaded by the Reapers, the Vektor Rifle is a purpose-built sniper rifle designed for long range engagement and squad support. A relatively light weapon with excellent corrosion Resistance, it is ideal for the harsh environments typically associated with the Reaper faction."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> The Vektor Rifle is effective at all ranges."
AbilityDescName="vektor rifle"
[MZ_ShrikeVektor_MG X2WeaponTemplate]
FriendlyName="Shrike Temnotic Rifle"
FriendlyNamePlural="Shrike Temnotic Rifles"
BriefSummary="Reliant on a specialized cartridge presumably handloaded by the Reapers, the Vektor Rifle is a purpose-built sniper rifle designed for long range engagement and squad support. A relatively light weapon with excellent corrosion Resistance, it is ideal for the harsh environments typically associated with the Reaper faction."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> The Vektor Rifle is effective at all ranges."
AbilityDescName="vektor rifle"
[MZ_ShrikeVektor_BM X2WeaponTemplate]
FriendlyName="Shrike Shadow Lance"
FriendlyNamePlural="Shrike Shadow Lances"
BriefSummary="Reliant on a specialized cartridge presumably handloaded by the Reapers, the Vektor Rifle is a purpose-built sniper rifle designed for long range engagement and squad support. A relatively light weapon with excellent corrosion Resistance, it is ideal for the harsh environments typically associated with the Reaper faction."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> The Vektor Rifle is effective at all ranges."
AbilityDescName="vektor rifle"

[MZ_ShrikeBullpup_CV X2WeaponTemplate]
FriendlyName="Shrike-7 Bullpup"
FriendlyNamePlural="Shrike-7 Bullpups"
BriefSummary="The Skirmishers make for dangerous melee combatants, but they still rely on a unique Bullpup rifle design adapted from the weapons they were originally assigned during their service to ADVENT. At close range, these shotguns provide excellent stopping power, while the stock improves recovery time during extended firing."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the Bullpup does not end the Skirmisher's turn, and it can be fired twice in a single turn.\n<Bullet/> Bullpups are extremely effective at close range, but their accuracy drops off quickly at longer range."
AbilityDescName="bullpup"
[MZ_ShrikeBullpup_MG X2WeaponTemplate]
FriendlyName="Shrike-15 Bullpup"
FriendlyNamePlural="Shrike-15 Bullpups"
BriefSummary="The Skirmishers make for dangerous melee combatants, but they still rely on a unique Bullpup rifle design adapted from the weapons they were originally assigned during their service to ADVENT. At close range, these shotguns provide excellent stopping power, while the stock improves recovery time during extended firing."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the Bullpup does not end the Skirmisher's turn, and it can be fired twice in a single turn.\n<Bullet/> Bullpups are extremely effective at close range, but their accuracy drops off quickly at longer range."
AbilityDescName="bullpup"
[MZ_ShrikeBullpup_BM X2WeaponTemplate]
FriendlyName="Shrike-90 Bullpup"
FriendlyNamePlural="Shrike-90 Bullpups"
BriefSummary="The Skirmishers make for dangerous melee combatants, but they still rely on a unique Bullpup rifle design adapted from the weapons they were originally assigned during their service to ADVENT. At close range, these shotguns provide excellent stopping power, while the stock improves recovery time during extended firing."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the Bullpup does not end the Skirmisher's turn, and it can be fired twice in a single turn.\n<Bullet/> Bullpups are extremely effective at close range, but their accuracy drops off quickly at longer range."
AbilityDescName="bullpup"

[MZ_ShrikeSidearm_CV X2WeaponTemplate]
FriendlyName="Shrike Autopistol"
FriendlyNamePlural="Shrike Autopistol"
BriefSummary="Should their power fail them for some reason, the Templars rely on a relatively conventional pistol arrangement that has been modified to specifically enhance its rate of fire and overall handling. This straightforward design contributes to the weapon's reliability in spite of the inconsistent material quality found in its construction."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> The Autopistol gives the Templar the flexibility to combat the enemy in a conventional manner when not using their Psionic abilities.\n<Bullet/> Autopistols can be fired with a single action."
AbilityDescName="autopistol"
[MZ_ShrikeSidearm_MG X2WeaponTemplate]
FriendlyName="Shrike Mag Autopistol"
FriendlyNamePlural="Shrike Mag Autopistol"
BriefSummary="Should their power fail them for some reason, the Templars rely on a relatively conventional pistol arrangement that has been modified to specifically enhance its rate of fire and overall handling. This straightforward design contributes to the weapon's reliability in spite of the inconsistent material quality found in its construction."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> The Autopistol gives the Templar the flexibility to combat the enemy in a conventional manner when not using their Psionic abilities.\n<Bullet/> Autopistols can be fired with a single action."
AbilityDescName="autopistol"
[MZ_ShrikeSidearm_BM X2WeaponTemplate]
FriendlyName="Shrike Beam Autopistol"
FriendlyNamePlural="Shrike Beam Autopistol"
BriefSummary="Should their power fail them for some reason, the Templars rely on a relatively conventional pistol arrangement that has been modified to specifically enhance its rate of fire and overall handling. This straightforward design contributes to the weapon's reliability in spite of the inconsistent material quality found in its construction."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> The Autopistol gives the Templar the flexibility to combat the enemy in a conventional manner when not using their Psionic abilities.\n<Bullet/> Autopistols can be fired with a single action."
AbilityDescName="autopistol"

[MZ_ShrikePistol_CV X2WeaponTemplate]
FriendlyName="Shrike Pistol"
FriendlyNamePlural="Shrike Pistols"
BriefSummary="XCOM Sharpshooters carry high-caliber pistols in addition to their sniper rifles. With the proper training, Sharpshooters can pose an enormous threat at close range."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Pistols can be much more than a sidearm in the hands of a trained Sharpshooter.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action.\n<Bullet/> Sharpshooters can train several abilities that dramatically enhance their use of pistols."
AbilityDescName="pistol"
[MZ_ShrikePistol_MG X2WeaponTemplate]
FriendlyName="Shrike Mag Pistol"
FriendlyNamePlural="Shrike Mag Pistols"
BriefSummary="Based on the advances in magnetic weapons tech we've achieved, this new pistol boasts a substantial improvement in power over our conventional pistol."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Magnetic pistols are substantially more effective than their conventional precursors.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action."
AbilityDescName="pistol"
[MZ_ShrikePistol_BM X2WeaponTemplate]
FriendlyName="Shrike Beam Pistol"
FriendlyNamePlural="Shrike Beam Pistols"
BriefSummary="The ultimate sidearm, this pistol integrates the aliens' beam weapons technology to powerful effect."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Beam pistols are the most powerful handguns on Earth.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action."
AbilityDescName="pistol"

[MZ_ShrikeRifle_CV X2WeaponTemplate]
FriendlyName="Shrike Assault Rifle"
FriendlyNamePlural="Shrike Assault Rifles"
BriefSummary="We've managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="assault rifle"
[MZ_ShrikeRifle_MG X2WeaponTemplate]
FriendlyName="Shrike Magnetic Rifle"
FriendlyNamePlural="Shrike Magnetic Rifles"
BriefSummary="Magnetized projectile tech has enabled us to create rifle-style slugthrowers. They represent a substantial improvement in power relative to conventional assault rifles."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="assault rifle"
[MZ_ShrikeRifle_BM X2WeaponTemplate]
FriendlyName="Shrike Plasma Rifle"
FriendlyNamePlural="Shrike Plasma Rifles"
BriefSummary="Now that we've finally deciphered the aliens' devastating weapon technology and can develop beam weapons of our own, we can build rifles that will be the match of any enemy our soldiers encounter in the field."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training."
AbilityDescName="assault rifle"

[MZ_ShrikeShotgun_CV X2WeaponTemplate]
FriendlyName="Shrike Shotgun"
FriendlyNamePlural="Shrike Shotguns"
BriefSummary="We've managed to salvage a variety of standard infantry small arms; this is a specialized weapon for close range engagement. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/> Shotguns are extremely effective at close range, but their accuracy drops off quickly at longer range."
AbilityDescName="shotgun"
[MZ_ShrikeShotgun_MG X2WeaponTemplate]
FriendlyName="Shrike Shard Gun"
FriendlyNamePlural="Shrike Shard Guns"
BriefSummary="Magnetic weapons technology will let us synthesize alien alloy fragments into a spray-style projectile, and our Rangers can use it to dramatic effect: the closer the better."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/> Shotguns are extremely effective at close range, but their accuracy drops off quickly at longer range."
AbilityDescName="shotgun"
[MZ_ShrikeShotgun_BM X2WeaponTemplate]
FriendlyName="Shrike Storm Gun"
FriendlyNamePlural="Shrike Storm Guns"
BriefSummary="The Storm Gun fires a concentrated set of beam pulses, piercing and melting the target across a substantial surface area."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/> Shotguns are extremely effective at close range, but their accuracy drops off quickly at longer range."
AbilityDescName="shotgun"

[MZ_ShrikeSnipercaster_CV X2WeaponTemplate]
FriendlyName="Shrike Sniper Boltcaster"
FriendlyNamePlural="Shrike Sniper Boltcasters"
BriefSummary="Discovered among a cache of seemingly archaic weaponry, the Bolt Caster is deceptively powerful but limited by a slow rate of fire."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> Launches a single, high-damage projectile, but must be reloaded after each use."
AbilityDescName="sniper boltcaster"
[MZ_ShrikeSnipercaster_MG X2WeaponTemplate]
FriendlyName="Shrike Magnetic Sniper Boltcaster"
FriendlyNamePlural="Shrike Magnetic Sniper Boltcasters"
BriefSummary="By modifying the armature and permanently affixing a series of magnets along its stock, we were able to substantially increase the damage output of the traditional Bolt Caster through electromagnetic propulsion."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> The addition of a magnetic coil increases the damage of each individual bolt.\n<Bullet/> Launches a single, high-damage projectile, but must be reloaded after each use."
AbilityDescName="sniper boltcaster"
[MZ_ShrikeSnipercaster_BM X2WeaponTemplate]
FriendlyName="Shrike Plasma Sniper Boltcaster"
FriendlyNamePlural="Shrike Plasma Sniper Boltcasters"
BriefSummary="The introduction of a miniturized Elerium power cell allows the Bolt Caster to generate electromagnetically focused bursts of Plasma with each bolt fired."
TacticalText="<Bullet/> Shrike weapons use specialized bitterfrost rounds, and cannot benefit from other ammo types.\n<Bullet/> An Elerium-enhanced launcher makes this the deadliest version of the Bolt Caster.\n<Bullet/> Launches a single, high-damage projectile, but must be reloaded after each use."
AbilityDescName="sniper boltcaster"

[MZ_FrostShield_CV X2WeaponTemplate]
FriendlyName="Shrike Frost Shield"
FriendlyNamePlural="Shrike Frost Shields"
BriefSummary="Shields are one of the oldest forms of additional protection known to mankind. We were able to scrap together enough metallic and ceramic armored plates to form a basic ballistic shield capable of withstanding a moderate amount of punishment."
TacticalText="<Bullet/> Melee attacks with the shield inflict bitterfrost instead of the typical disorient.<br/><Bullet/> Frost Shields provide the same mitigation as the ADVENT Frost Legion.<br/><Bullet/> Carrying a shield encumbers the soldier, resulting in a <Ability:BS_TAG_SHIELD_MOBILITY_PENALTY/> Mobility and <Ability:BS_TAG_SHIELD_AIM_PENALTY/> Aim penalties."
AbilityDescName="shield"
[MZ_FrostShield_MG X2WeaponTemplate]
FriendlyName="Shrike Alloy Shield"
FriendlyNamePlural="Shrike Alloy Shields"
BriefSummary="The use of alien alloys has not only made our ballistic shields stronger, but lighter as well. Complex polymer and ceramic materials allow for better heat distribution, making users less likely to be injured by shrapnel and molten material from their own protective gear. Integrated LED tablet allows monitoring the tactical situation without being exposed to enemy fire."
TacticalText="<Bullet/> Melee attacks with the shield inflict bitterfrost instead of the typical disorient.<br/><Bullet/> Frost Shields provide the same mitigation as the ADVENT Frost Legion.<br/><Bullet/> Carrying a shield encumbers the soldier, resulting in a <Ability:BS_TAG_SHIELD_MOBILITY_PENALTY/> Mobility and <Ability:BS_TAG_SHIELD_AIM_PENALTY/> Aim penalties."
AbilityDescName="shield"
[MZ_FrostShield_BM X2WeaponTemplate]
FriendlyName="Shrike Powered Shield"
FriendlyNamePlural="Shrike Powered Shields"
BriefSummary="Advances in energy cell miniaturization allow this shield to provide not only conventional kinetic protection, but more exotic like energy repulsion as well. An integrated holographic system ensures the user's situational awareness remains unimpaired."
TacticalText="<Bullet/> Melee attacks with the shield inflict bitterfrost instead of the typical disorient.<br/><Bullet/> Frost Shields provide the same mitigation as the ADVENT Frost Legion.<br/><Bullet/> Carrying a shield encumbers the soldier, resulting in a <Ability:BS_TAG_SHIELD_MOBILITY_PENALTY/> Mobility and <Ability:BS_TAG_SHIELD_AIM_PENALTY/> Aim penalties."
AbilityDescName="shield"